garyPenhook/PyAvrOCD/svd/avr32la14.svd
        <register>
          <name>EVGENCTRL</name>
          <description>Event Generation Control</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP0EV</name>
              <description>Compare 0 Event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Event output for CMP is a pulse</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAVEFORM</name>
                  <description>Event output for CMP is equal to waveform</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1EV</name>
              <description>Compare 1 Event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Event output for CMP is a pulse</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAVEFORM</name>
                  <description>Event output for CMP is equal to waveform</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP2EV</name>
              <description>Compare 2 Event</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Event output for CMP is a pulse</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAVEFORM</name>
                  <description>Event output for CMP is equal to waveform</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0</name>
              <description>Compare 0 Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare 1 Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2</name>
              <description>Compare 2 Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0</name>
              <description>Compare 0 Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare 1 Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2</name>
              <description>Compare 2 Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>Period</description>
          <addressOffset>0x26</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PERBUF</name>
          <description>Period Buffer</description>
          <addressOffset>0x36</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary data for 16-bit Access</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
