garyPenhook/PyAvrOCD/svd/avr32la14.svd
        <register>
          <name>CTRLF</name>
          <description>Control F</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRKLEN</name>
              <description>Break Length</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>13BIT</name>
                  <description>Break field transmission is 13 bit time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17BIT</name>
                  <description>Break field transmission is 17 bit time</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21BIT</name>
                  <description>Break field transmission is 21 bit time</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26BIT</name>
                  <description>Break field transmission is 26 bit time</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GUARD</name>
              <description>Guard Time</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1BIT</name>
                  <description>Guard time is 1 bit time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BIT</name>
                  <description>Guard time is 4 bit times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>Guard time is 8 bit times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14BIT</name>
                  <description>Guard time is 14 bit times</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTDLY</name>
              <description>Inter-byte Delay</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLG</name>
          <description>Control G</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROTCONV</name>
              <description>Protocol Converter</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Protocol conversion disabled. Normal data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>Single char for both '0' and '1'. Frame error set if values don't match</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>CHARMASK works as a mask</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL</name>
                  <description>CHARMASK defines second value for '1'</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENC</name>
              <description>Encoding</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ABW</name>
              <description>Auto Baud Window</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDW0</name>
                  <description>18% tolerance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDW1</name>
                  <description>15% tolerance</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDW2</name>
                  <description>21% tolerance</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDW3</name>
                  <description>25% tolerance</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXEI</name>
              <description>Receive Event Input Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRE</name>
              <description>Data Register Empty Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXC</name>
              <description>Transmit Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXC</name>
              <description>Receive Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXS</name>
              <description>Receiver Start Frame Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRK</name>
              <description>Receive Break Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSIC</name>
              <description>Clear to Send Input Change Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRE</name>
              <description>Data Register Empty Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXC</name>
              <description>Transmit Complete Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXC</name>
              <description>Receive Complete Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXS</name>
              <description>Receiver Start Frame Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRK</name>
              <description>Receive Break Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSIC</name>
              <description>Clear to Send Input Change Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATAH</name>
          <description>Receive Data</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA8</name>
              <description>Receiver Data Register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXC</name>
              <description>USART Receive Complete Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Frame Error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFOVF</name>
              <description>Buffer Overflow</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATAL</name>
          <description>Receive Data Low Byte</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>RX Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISF</name>
              <description>Inconsistent Sync Field</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COLL</name>
              <description>Collision Detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Frame Error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFOVF</name>
              <description>Buffer Overflow</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>Clear to Send</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXACTIVE</name>
              <description>Receive Active</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATAH</name>
          <description>Transmit Data High Byte</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA8</name>
              <description>Transmit Data Register (CHSIZE=9bit)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATAL</name>
          <description>Transmit Data Low Byte</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Transmit Data Register</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
